Revit 2026 API

# ProgressChangedEventArgsCancel Method

---

Requests to cancel the progress bar's operation.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Cancel()
```
```vb
Public Sub Cancel
```
```cpp
public:
void Cancel()
```
```fsharp
member Cancel : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The operation cannot be cancelled. |

Note that an operation may only be cancelled if its stage is 'Unchanged' or if its stage is 'PositionChanged' and the 'Cancellable' property is 'true.'

#### Reference

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace